trade/src/Catalogs/Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы/Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Основная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

trade/src/Catalogs/Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы/Forms/УстановкаКартинокИФайловХарактеристикамНоменклатуры/Module.bsl
&НаКлиенте
Процедура ОбновитьИнформациюОПрикрепленныхФайлах()
	
	Если Элементы.ХарактеристикиНоменклатуры.ТекущиеДанные <> Неопределено  тогда
		
		ПрисоединенныеФайлыХарактеристик.Параметры.УстановитьЗначениеПараметра("ХарактеристикаНоменклатуры"		, Элементы.ХарактеристикиНоменклатуры.ТекущиеДанные.Ссылка);
		
	Иначе
		
		ПрисоединенныеФайлыХарактеристик.Параметры.УстановитьЗначениеПараметра("ХарактеристикаНоменклатуры"		, Неопределено);
		
	КонецЕсли;
	
	Если Элементы.ХарактеристикиНоменклатуры.ТекущиеДанные <> Неопределено  тогда
		
		ПрисоединенныеФайлыХарактеристик.Параметры.УстановитьЗначениеПараметра("Номенклатура"		, Элементы.Товары.ТекущиеДанные.Ссылка);
		
	Иначе
		
		ПрисоединенныеФайлыХарактеристик.Параметры.УстановитьЗначениеПараметра("Номенклатура"		, Неопределено);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинку()
	
	Если Элементы.ПрисоединенныеФайлыХарактеристик.ТекущиеДанные <> Неопределено  тогда
		
		АдресКартинки = ПоместитьВоВременноеХранилище(ПолучитьКартинку(Элементы.ПрисоединенныеФайлыХарактеристик.ТекущиеДанные.Ссылка), УникальныйИдентификатор);
		
	Иначе
		
		АдресКартинки = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	лНоменклатура = Элементы.Товары.ТекущиеДанные;
	
	Если лНоменклатура <> Неопределено  тогда
		
		ХарактеристикиНоменклатуры.Параметры.УстановитьЗначениеПараметра("Номенклатура"					, лНоменклатура.Ссылка);
		ХарактеристикиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ВидНоменклатуры"				, лНоменклатура.ВидНоменклатуры);
		ХарактеристикиНоменклатуры.Параметры.УстановитьЗначениеПараметра("ИспользованиеХарактеристик"	, лНоменклатура.ИспользованиеХарактеристик);
		
	КонецЕсли;
	
	ОбновитьИнформациюОПрикрепленныхФайлах();
	
	ОбновитьКартинку();

КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикиНоменклатурыПриАктивизацииСтроки(Элемент)
	
	ОбновитьИнформациюОПрикрепленныхФайлах();
	
	ОбновитьКартинку();

КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлыХарактеристикПриАктивизацииСтроки(Элемент)
	
	ОбновитьКартинку();

КонецПроцедуры

&НаСервере
Функция ПолучитьКартинку(ПрисоединенныйФайл)
	
	Возврат Справочники.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.ПолучитьКартинкуПоПрикрепленномуФайлу(ПрисоединенныйФайл);
	
КонецФункции

&НаКлиенте
Процедура ПрисоединенныеФайлыХарактеристикПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
		
	Если Элементы.ХарактеристикиНоменклатуры.ТекущиеДанные = Неопределено тогда
		//Отказ = Истина;
		Возврат;		
	КонецЕсли;
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено тогда
		//Отказ = Истина;
		Возврат;		
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru = 'Укажите файл/картинку'");
	
	ОбработкаОкончанияЗагрузки = Новый ОписаниеОповещения("ПрисоединенныеФайлыХарактеристикПередНачаломДобавленияЗавершениеЗагрузки", ЭтотОбъект, Диалог); 
	НачатьПомещениеФайла(ОбработкаОкончанияЗагрузки, , Диалог, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрисоединенныеФайлыХарактеристикПередНачаломДобавленияЗавершениеЗагрузки(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		ПрисоединенныеФайлыХарактеристикПередНачаломДобавленияЗавершениеЗагрузкиСервер(Элементы.Товары.ТекущиеДанные.Ссылка, Элементы.ХарактеристикиНоменклатуры.ТекущиеДанные.Ссылка, Адрес, ВыбранноеИмяФайла);
		
		ОбновитьИнформациюОПрикрепленныхФайлах();
		ОбновитьКартинку();

	Иначе
		Сообщить("Файл не был указан.");
	КонецЕсли 
	
КонецПроцедуры

&НаСервере
Процедура ПрисоединенныеФайлыХарактеристикПередНачаломДобавленияЗавершениеЗагрузкиСервер(Номенклатура, Характеристика, Адрес, ВыбранноеИмяФайла)
	
		лИмяФайла = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьАдресВременногоФайлаСервер(Адрес, ВыбранноеИмяФайла); 
		 
		лФайл = Новый Файл(лИмяФайла);
																											
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("Номенклатура"				, Номенклатура);	
		ПараметрыФайла.Вставить("ХарактеристикаНоменклатуры", Характеристика);	
		ПараметрыФайла.Вставить("Наименование"				, лФайл.ИмяБезРасширения);	
		ПараметрыФайла.Вставить("ПутьКФайлу"				, лИмяФайла);	
		ПараметрыФайла.Вставить("Расширение"				, лФайл.Расширение);	
		ПараметрыФайла.Вставить("Размер"					, "0");	
		
		лПрисоединенныйФайл = ПолучитьНовыйПрисоединенныйФайл(ПараметрыФайла);
		
		
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("ПрисоединенныйФайл", лПрисоединенныйФайл);	
		ПараметрыФайла.Вставить("Картинка"			, ПоместитьВоВременноеХранилище(Новый Картинка(лИмяФайла), УникальныйИдентификатор));	
		
		ЗаписатьПрисоединенныйФайл(ПараметрыФайла);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыйПрисоединенныйФайл(ПараметрыФайла)
	
	лПрисоединенныйФайл = Справочники.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.СоздатьНовыйПрисоединенныйФайл(ПараметрыФайла);
	
	Возврат лПрисоединенныйФайл;
	
КонецФункции

&НаСервере
Процедура ЗаписатьПрисоединенныйФайл(ПараметрыФайла)
	
	Справочники.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.ЗаписатьПрисоединенныйФайл(ПараметрыФайла);
	
КонецПроцедуры
